<template>
  <div class="am-agreement">
    <h2 class="am-agreement-title">my社保用户协议书</h2>
    <div class="am-agreement-content">
        <p>欢迎您使用my社保服务（以下简称“本服务”）！</p>
        <p>用户注册并使用本服务前，应认真阅读《my社保用户协议书》（以下简称“本协议”）。我司提醒用户务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。</p>
        <p><span class="underline">用户完成注册程序即视为用户已充分阅读、理解并接受本协议的全部内容，同意受本协议的约束。如用户不同意本协议或本协议中的任何条款约定，应立即停止注册程序。（用户付费成功后即视为完成注册程序）</span></p>
        <p>根据中华人民共和国有关法律、法规的规定，本着平等互利的原则，经友好协商，双方同意就用户委托公司提供代理服务事宜使用互联网信息技术以数据电文形式订立本协议并认同其效力，于上海市黄浦区签订并达成如下一致内容：</p>
        <h4>第一条 定义</h4>
        <p>1、 用户（甲方）：愿意接受本协议各项约定，并在本协议约定下使用my社保产品的企事业单位、个体工商户等其他社会组织；<br/> 
          2、  公司（乙方）：指根据用户的需求，在经营所在地实际为客户提供人力资源服务的机构；<br/>
          3、  平台方：指通过互联网技术手段为用户提供数据查询、人力资源需求提交渠道的机构；<br/>
          4、  人力资源服务：包括依法为用户代缴社会保险、住房公积金服务，实际服务内容以甲乙双方共同确认后为准。<br/>
          5、  委托费用：系指乙方按照客户需求提供人力资源服务，并收取的各项费用的总和，包括为用户代缴的社会保险金、住房公积金和相关服务费。</p>
        <h4>第二条 甲方的权利义务：</h4>
        <p><span class="underline">1、甲方应自行诚信向本站提供注册资料，甲方确认其提供的注册资料真实、准确、完整、合法有效。如因甲方原因未及时交齐材料的，视为甲方放弃人力资源服务委托需求。如甲方信息有任何变更，应立即告知乙方或平台方。如果甲方注册资料不合法、不真实、不准确、不详尽的，甲方须承担因此引起的相应责任及后果，并且乙方有权终止甲方使用各项服务的权利。</span><br/>
        2、甲方有权要求乙方按照本合同的约定提供相应的委托服务，同时应向乙方及时足额支付委托费用。<br/> 
          3、甲方应根据公司要求及时将当月的委托费用一次性足额支付至指定账户。<br/> 
          4、甲方知悉并认可如下事实： 甲乙双方只存在人力资源服务代理关系，并不存在隶属关系或劳动关系；乙方不得安排甲方具体工作；甲方不得以乙方或乙方关联公司员工的名义开展工作，也不得向乙方或乙方关联公司主张劳动关系相关权利包括但不限于工作岗位、工资、工龄、年假、劳动合同、生育津贴补差等。<br/> 
          5、甲方不得通过非法手段套取甲方社保账户、公积金账户资金，亦不得将账户内资金用于非法业务。<br/> 
          6、甲方应妥善保管账户名、密码、数字证书（如有）、与账户绑定的手机号码、手机校验码等与账户有关的一切信息。甲方应确保不向其他任何人泄露前述信息，如因密码泄露导致的损失，由甲方自行承担。如甲方发现有他人冒用或盗用前述信息或任何其他未经合法授权的情形时，应立即以有效方式通知平台方，并要求平台方暂停本服务。<span class="underline">同时，甲方理解平台方对前述请求采取行动需要合理期限，在此之前，平台方对已执行的指令及（或）所导致的损失不承担任何责任。</span><br/> 
          7、甲方同意，平台方有权通过邮件、短信电话等形式，向在本平台注册、委托人力资源代理的用户发送订单信息、促销活动等告知信息。
          </p>
        <h4>第三条 乙方的权利义务：</h4>
        <p>1、 乙方可根据甲方的实际需要，按照国家及当地政策规定，为甲方办理社会保险、公积金的转入转出的相关手续。<br/>
          2、  乙方可为甲方提供社会保险、公积金代办参缴服务，甲方及其委托参保成员与乙方不存在任何劳动关系，且乙方对甲方及其委托参缴成员不具有任何基于劳动关系的权利义务。甲方的参缴条件、待遇享受条件、待遇享受标准等，均以征缴经办机构审核确定为准。<br/>
          3、  乙方所提供的相关服务信息随国家政策变动而做相应调整，社会保险、公积金的基数比例等也会根据各地政策的调整而做调整，如遇社会保险、公积金基数调整，缴费基数或比例调整致使社会保险、公积金费用上升的，甲方在接到平台方通知后，应在规定的时间内将相应的费用及时足额支付至指定账户。本条规定不因本协议的解除或终止等原因而免除甲方的义务或责任。甲方如未及时补足因此而产生的费用差额，乙方有权暂停或终止人力资源服务。<br/>
          4、  在甲方未按照约定数额支付全部费用之前，乙方有权不向甲方提供服务或者终止服务。<br/>
          5、  平台方与乙方应尊重并保护用户的个人隐私权，为了给用户提供更准确、更有个性化的服务，平台方与乙方将按本协议规定使用和披露用户个人信息。<br/>
          <span class="underline">6、  甲方知悉并同意，如甲方未能通过乙方连续缴纳社会保险金满12个月，则乙方有权拒绝甲方提出的关于领取生育津贴的申请。</span><br/>
          <span class="underline">7、  凡曾患有恶性肿瘤、心脏病（心功能不全Ⅱ级以上）、心肌梗塞、白血病、高血压病（Ⅱ级以上）、肝硬化、慢性阻塞性支气管疾病、脑血管疾病、慢性肾脏疾病、糖尿病、再生障碍性贫血、先天性疾病、精神病或者精神分裂、癫痫病、特定传染病、艾滋病、性病或者正患病住院及全休、半休者、怀孕、工伤申报中请勿通过本平台参保，如有参保，乙方有权不提供报销材料与服务,以及单方面终止缴纳。</span><br/>
          <span class="underline">8、  鉴于甲方与乙方仅为人力资源服务代理关系，如：1）甲方在申请享受社会保险待遇（包括但不限于养老、医疗、工伤、生育、失业）或公积金待遇时，需乙方提供任何可能导致被误解为甲乙双方存在劳动关系的书面文件，乙方有权拒绝。2）甲方社保缴交基数高于乙方上一年度月平均工资，导致甲方生育津贴低于其社保缴费基数，如甲方提出由乙方补足差额的，乙方有权拒绝。</span>
          </p>
        <h4>第四条 服务收费</h4>
        <p>1、服务收费分为委托业务代收付费用与委托业务服务费，具体收费标准和支付周期按双方协议约定执行。<br/>
            <span class="underline">2、委托费用经平台方出具相应明细，甲方应按本协议约定及明细金额按时向指定账户一次性全额支付，如实际参保情况有差异，将在下一周期内多退少补。</span><br/>
            <span class="underline">3、甲方应认真核对服务明细，前述明细一经甲方确认，不可擅自取消、修改。如有违反，即视为违约，乙方或平台方有权扣除全部或部分委托费用作为违约金。如前述费用无法弥补非违约方损失，乙方或平台方有权另行追偿。</span><br/>
            <span class="underline">4、 非因乙方或平台方过错导致甲方委托业务未能成功申报，甲方可选择退回委托业务代收付费用，但服务费不予退还。
            </span>
          </p>
        <h4>第五条 保密义务</h4>
        <p>1、除本协议另有约定外，对本协议的内容，以及在本协议履行过程中获得的对方的信息，均负有保密义务。保密信息包括但不限于本协议文本以及任何一方标有保密字样的往来文件。<br/>
            2、除双方另有约定外，保密义务是指在未经对方书面同意前，一方不得将保密信息用于任何与其执行职务无关的情况；或以任何形式向任何第三方泄漏，任意一方均有义务尽其一切努力防止任何第三方窃取秘密信息。由于任何一方违反以上保密义务给对方造成损失，违约方对受损失方负有停止侵害、消除影响、赔偿损失的责任。
          </p>
        <h4>第六条 违约责任</h4>
        <p>1、任何一方未按照本协议的约定履行义务导致对方遭受经济损失的，应承担相应的赔偿责任。<br/>
            <span class="underline">2、甲方须在本协议规定的时间内向乙方足额支付委托费用。乙方没有为甲方垫款的义务，若甲方逾期支付总费用或差额费用，乙方有权暂停全部或部分服务。若造成甲方相关业务不能正常办理、相关待遇不能正常享受，或甲方被相关行政管理部门征收滞纳金的，由甲方承担全部责任。</span>
          </p>
        <h4>第七条终止与解除</h4>
        <p>1、本合同自甲方向平台方完成缴费之日起生效。<br/>
            2、任何一方违反本合同的约定，在收到对方要求改正的书面通知后超过10日仍未改正的，另一方有权书面通知对方解除本合同，自书面通知发出之日起自行解除。
          </p>
        <h4>第八条争议的解决</h4>
        <p>本合同履行期间，如发生争议，应通过友好协商解决。<span class="underline">如协商不成，任何一方应向上海市黄浦区人民法院提起诉讼。</span>
          </p>
        <h4>第九条其他</h4>
        <p>1、 本平台所对于注册会员的通知及任何其他的协议、告示或其他关于注册会员使用会员账户及服务的通知，注册会员同意本平台可通过平台公告、站内信、电子邮件、手机短信、无线通讯装置等电子方式或邮寄等物理方式进行，该等通知于发送之日视为已送达收件人（如以邮寄方式向个注册会员发出通知的，则在该等通知按照注册会员在本平台留存的联系地址交邮后的第三个自然日即视为送达）。<span class="underline">因不可归责于本平台的原因（包括但不限于电子邮件地址、手机号码、联系地址等不准确或无效、信息传输故障等）导致注册会员未在前述通知视为送达之日收到该等通知的，本平台不承担任何责任。</span><br/>
            <span class="underline">2、  因信息网络设备维护、连接故障，电脑、通讯或其他系统故障，受到黑客攻击、木马或其他恶意程序，电力故障，爆炸，火灾，洪水，风暴，罢工，暴乱，战争，政府行为，司法行政机关命令或任何因第三方原因导致贵司遭受损害的，本平台不承担责任。</span><br/>
            <span class="underline">3、  甲方已授权平台方将甲方的支付宝账户及相关信息等传递给第三方，用于第三方为您提供服务。</span>平台方会要求该第三方依法使用甲方的信息，并进行保密。<br/>
            <span class="underline">4、  甲乙双方理解并通知，平台方有权随时对本协议内容进行变更并在平台方客户端或网站进行公告，无需另行单独通知。该等变更自公告载明的生效时间开始生效，并成为本协议的一部分。</span><br/>
            5、  本合同在履行过程中如发现有未尽事宜，可按照中华人民共和国的法律、法规另行订立书面补充约定。
          </p>
    </div>
  </div>
</template>

<script>
import { PublicValue } from '@/service'
export default {
  name: 'Agreement',
  data () {
    // 监控埋点
    _czc.push(['_trackEvent', '代缴协议', '点击查看'])
    let payment = JSON.parse(PublicValue.get('payment'))
    let day = payment.payEndDayOptions[payment.payMonth].payEndDay.split('-')
    return {
      payment: JSON.parse(PublicValue.get('payment')),
      day: day
    }
  }
}
</script>
<style scoped>
  .underline{
    font-size: 14px;
    color: #000;
    text-decoration:underline;
    font-weight: bold;
  }
</style>

